window.STAGE={id:1,levels:[
        {n:'Уровень 1: Знакомство', s:'У каждого своя дверь. Чужая стихия — опасна.', m:{10:'......h....h.....h',12:'.1.2................f.w',13:'########WW####FF#######'}},
        {n:'Уровень 2: Первая преграда', s:'Перепрыгните лужи друг друга.', m:{9:'..........h',10:'.......h......h',11:'..........##',12:'.1.2................f.w',13:'######WWW####FFF#######'}},
        {n:'Уровень 3: Кнопка', s:'Один держит ворота, другой проходит.', gt:[[12,"A"]], m:{10:'.....h...........h',12:'.1.2...a......a.....f.w',13:'#######################'}},
        {n:'Уровень 4: Высокий подъем', s:'Идите поверху — внизу опасно.', m:{7:'..........h.h',9:'.........#####',11:'.....###........###',12:'.1.2................f.w',13:'########WWWWFFFF#######'}},
        {n:'Уровень 5: Два замка', s:'Каждые ворота — своя пара кнопок.', gt:[[9,"A"],[17,"B"]], m:{10:'.........h....h',12:'.1.2.a....a..b....b.f.w',13:'#######################'}},
        {n:'Уровень 6: Узкие тропинки', s:'Осторожнее на поворотах.', m:{10:'......h....h...h',12:'.1.2................f.w',13:'#####WWW##FFF##WW######'}},
        {n:'Уровень 7: Мостики', s:'Вместе преодолеваем пропасти.', m:{9:'.......h.......h',11:'.....#####...#####',12:'.1.2................f.w',13:'#####WWWWW###FFFFF#####'}},
        {n:'Уровень 8: Симметрия', s:'Ворота посередине, лужи по краям.', gt:[[12,"A"]], m:{10:'.......h.......h',12:'.1.2.....a...a......f.w',13:'#####FF#########WW#####'}},
        {n:'Уровень 9: Испытание высоты', s:'Выше только звёзды.', m:{3:'..................h.###',5:'..............h..###',7:'..........h..###',9:'.........###',11:'.....###',12:'.1.2................f.w',13:'########WWWWFFFFF######'}},
        {n:'Уровень 10: Финал этапа', s:'Вместе к дверям первого этапа!', gt:[[9,"A"],[17,"B"]], m:{10:'...........h.....h',12:'.1.2..a..a....b...b.f.w',13:'##########WWW##########'}}
]};
